using System;
using System.Collections.Generic;
using System.Text;

namespace RegularExpr
{
    // Ссылки вперед и назад. Просмотр вперед и назад
    class Sample6
    {
        public static void Demo()
        {
            // (?=expr)    проверяет, соответствует ли текст после этой конструкции выражению expr
            // (?!=expr)   требуется чтобы текст после конструкции не соответствовал выражению expr
            // (?<=expr)   проверяет, соответствует ли текст перед этой конструкцией выражению expr
            // (?<!expr)   требуется чтобы текст перед конструкцией не соответствовал выражению expr
            //
            //
            //
            //
        }
    }
}
